app/views/users/index.html.erb

      <label for="">Welcome</label>
      <% current_user = User.find_by id: session[:user_id]%>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1