app/controllers/users_controller.rb

  def show
    @user = User.find_by id: params[:id]
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def create
    @user = User.new user_params
    @_user = User.find_by! name: @user.name
    if(@_user.present?)
      flash[:danger] = "Register failed"
      redirect_to new_user_path
      return
    end
    if(@user.save)
---
SELECT  `users`.* FROM `users` WHERE `users`.`name` = 'admin' LIMIT 1
INSERT INTO `users` (`name`, `password_digest`, `created_at`, `updated_at`) VALUES ('1234', '$2a$10$2vHbLcqAMJRJ5C6cQW/M6.pnIA/qbmBgIG.11eXdefqggRoidiuyq', '2018-05-16 08:24:42', '2018-05-16 08:24:42')

  def delete_user_with_user_name
    if(User.find(params[:id]).destroy)
---
DELETE FROM `users` WHERE `users`.`id` = 13
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 13 LIMIT 1